app/controllers/apps_controller.rb

def create
  @job = Job.find(params[:job_id])
  @app = @job.apps.build(params[:app])
  if @app.save
---
INSERT INTO "apps" ("created_at", "email", "job_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 20 Aug 2012 15:22:46 UTC +00:00], ["email", "vars5@msn.com"], ["job_id", 2], ["name", "Varun Chhabra"], ["updated_at", Mon, 20 Aug 2012 15:22:46 UTC +00:00]]

def show

  @app = App.find(params[:id])
  @note = @app.notes.build
  @feed = @app.notes.paginate(:page => params[:page], :per_page => 30)
---
SELECT "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "notes".* FROM "notes" WHERE "notes"."app_id" = 1 ORDER BY "notes"."id" DESC LIMIT 30 OFFSET 0