app/controllers/jobs_controller.rb

def show
  @job = current_user.jobs.find(params[:id])
  @app = @job.apps.all
---
SELECT "apps".* FROM "apps" WHERE "apps"."job_id" = 1