app/controllers/notes_controller.rb

  def create
    #@something = params(:id)
    #@app = App.create(params[:app])
    #@app.app_id = params[:app][:id]

    #@app = params[:id]
    #@note = @app.notes.build(params[:note])
    #@app= App.find(params[:id])

    @app = App.find(params[:note][:app_id])
    @note = @app.notes.build(params[:note])
    @note.user_id = current_user.id
    @note.note = "remove column"
    if @note.save
---
SELECT "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "apps" ("created_at", "email", "job_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 23 Aug 2012 09:42:14 UTC +00:00], ["email", nil], ["job_id", nil], ["name", nil], ["updated_at", Thu, 23 Aug 2012 09:42:14 UTC +00:00]]
INSERT INTO "notes" ("app_id", "comment", "created_at", "note", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["app_id", 13], ["comment", "TEST"], ["created_at", Thu, 23 Aug 2012 09:42:14 UTC +00:00], ["note", nil], ["updated_at", Thu, 23 Aug 2012 09:42:14 UTC +00:00], ["user_id", nil]]